inventory_service_perf/wrk_report/inventory_python310_mix_1100.txt
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 6.735ms, rate sampling interval: 28ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.70ms   19.60ms 494.59ms   96.18%
    Req/Sec     1.12k   202.05     1.67k    78.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.57ms
 75.000%    9.11ms
 90.000%   17.34ms
 99.000%   99.14ms
 99.900%  251.77ms
 99.990%  384.51ms
 99.999%  447.23ms
100.000%  494.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.743     0.000000            1         1.00
       1.921     0.100000        12058         1.11
       2.483     0.200000        24097         1.25
       3.285     0.300000        36151         1.43
       4.551     0.400000        48201         1.67
       5.567     0.500000        60223         2.00
       6.055     0.550000        66261         2.22
       6.611     0.600000        72265         2.50
       7.255     0.650000        78308         2.86
       8.007     0.700000        84315         3.33
       9.111     0.750000        90327         4.00
       9.887     0.775000        93344         4.44
      10.855     0.800000        96349         5.00
      12.071     0.825000        99372         5.71
      13.583     0.850000       102367         6.67
      15.135     0.875000       105394         8.00
      16.119     0.887500       106886         8.89
      17.343     0.900000       108401        10.00
      18.831     0.912500       109900        11.43
      20.303     0.925000       111402        13.33
      21.887     0.937500       112914        16.00
      22.895     0.943750       113658        17.78
      24.095     0.950000       114410        20.00
      25.935     0.956250       115170        22.86
      30.079     0.962500       115915        26.67
      37.759     0.968750       116667        32.00
      42.655     0.971875       117043        35.56
      48.191     0.975000       117420        40.00
      55.999     0.978125       117796        45.71
      64.703     0.981250       118171        53.33
      73.023     0.984375       118548        64.00
      77.759     0.985938       118738        71.11
      85.887     0.987500       118925        80.00
      94.527     0.989062       119112        91.43
     102.783     0.990625       119300       106.67
     113.535     0.992188       119490       128.00
     123.007     0.992969       119585       142.22
     130.751     0.993750       119678       160.00
     140.543     0.994531       119771       182.86
     151.039     0.995313       119865       213.33
     163.583     0.996094       119959       256.00
     169.983     0.996484       120007       284.44
     176.767     0.996875       120053       320.00
     185.471     0.997266       120100       365.71
     197.503     0.997656       120148       426.67
     208.639     0.998047       120195       512.00
     216.959     0.998242       120218       568.89
     224.639     0.998437       120241       640.00
     229.631     0.998633       120265       731.43
     238.847     0.998828       120288       853.33
     253.823     0.999023       120312      1024.00
     261.503     0.999121       120324      1137.78
     269.055     0.999219       120335      1280.00
     275.967     0.999316       120347      1462.86
     286.463     0.999414       120360      1706.67
     296.191     0.999512       120371      2048.00
     301.055     0.999561       120377      2275.56
     308.735     0.999609       120382      2560.00
     321.279     0.999658       120389      2925.71
     335.871     0.999707       120394      3413.33
     345.087     0.999756       120400      4096.00
     348.159     0.999780       120403      4551.11
     354.047     0.999805       120406      5120.00
     357.631     0.999829       120409      5851.43
     374.783     0.999854       120412      6826.67
     380.159     0.999878       120415      8192.00
     383.487     0.999890       120416      9102.22
     385.023     0.999902       120418     10240.00
     387.839     0.999915       120419     11702.86
     391.679     0.999927       120421     13653.33
     397.055     0.999939       120422     16384.00
     406.015     0.999945       120423     18204.44
     406.271     0.999951       120424     20480.00
     406.271     0.999957       120424     23405.71
     418.815     0.999963       120425     27306.67
     422.399     0.999969       120426     32768.00
     422.399     0.999973       120426     36408.89
     428.799     0.999976       120427     40960.00
     428.799     0.999979       120427     46811.43
     428.799     0.999982       120427     54613.33
     447.231     0.999985       120428     65536.00
     447.231     0.999986       120428     72817.78
     447.231     0.999988       120428     81920.00
     447.231     0.999989       120428     93622.86
     447.231     0.999991       120428    109226.67
     494.847     0.999992       120429    131072.00
     494.847     1.000000       120429          inf
#[Mean    =        9.705, StdDeviation   =       19.601]
#[Max     =      494.592, Total count    =       120429]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  131756 requests in 2.00m, 40.22MB read
Requests/sec:   1097.96
Transfer/sec:    343.24KB