inventory_service_perf/wrk_report/inventory_python310_write_1000.txt
Running 2m test @ http://eniac-bench:8080
  1 threads and 100 connections
  Thread calibration: mean lat.: 401.101ms, rate sampling interval: 1488ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28s   936.55ms   5.79s    69.81%
    Req/Sec     0.98k    54.51     1.04k    90.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.09s 
 75.000%    1.79s 
 90.000%    2.55s 
 99.000%    4.26s 
 99.900%    5.55s 
 99.990%    5.78s 
 99.999%    5.79s 
100.000%    5.79s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.935     0.000000            1         1.00
     260.351     0.100000        10779         1.11
     453.119     0.200000        21543         1.25
     650.239     0.300000        32320         1.43
     859.135     0.400000        43090         1.67
    1085.439     0.500000        53877         2.00
    1203.199     0.550000        59259         2.22
    1328.127     0.600000        64615         2.50
    1463.295     0.650000        70009         2.86
    1623.039     0.700000        75387         3.33
    1793.023     0.750000        80778         4.00
    1892.351     0.775000        83479         4.44
    2008.063     0.800000        86165         5.00
    2134.015     0.825000        88867         5.71
    2258.943     0.850000        91549         6.67
    2392.063     0.875000        94233         8.00
    2461.695     0.887500        95571         8.89
    2547.711     0.900000        96934        10.00
    2660.351     0.912500        98261        11.43
    2781.183     0.925000        99630        13.33
    2904.063     0.937500       100971        16.00
    2969.599     0.943750       101633        17.78
    3039.231     0.950000       102308        20.00
    3123.199     0.956250       102979        22.86
    3215.359     0.962500       103648        26.67
    3360.767     0.968750       104327        32.00
    3448.831     0.971875       104660        35.56
    3549.183     0.975000       104994        40.00
    3682.303     0.978125       105327        45.71
    3772.415     0.981250       105673        53.33
    3893.247     0.984375       106002        64.00
    3977.215     0.985938       106169        71.11
    4093.951     0.987500       106336        80.00
    4198.399     0.989062       106505        91.43
    4317.183     0.990625       106678       106.67
    4423.679     0.992188       106843       128.00
    4456.447     0.992969       106926       142.22
    4530.175     0.993750       107015       160.00
    4607.999     0.994531       107095       182.86
    4747.263     0.995313       107178       213.33
    4919.295     0.996094       107263       256.00
    5148.671     0.996484       107304       284.44
    5292.031     0.996875       107346       320.00
    5361.663     0.997266       107389       365.71
    5419.007     0.997656       107431       426.67
    5455.871     0.998047       107474       512.00
    5476.351     0.998242       107494       568.89
    5484.543     0.998437       107515       640.00
    5496.831     0.998633       107537       731.43
    5521.407     0.998828       107559       853.33
    5554.175     0.999023       107577      1024.00
    5570.559     0.999121       107588      1137.78
    5586.943     0.999219       107603      1280.00
    5595.135     0.999316       107614      1462.86
    5599.231     0.999414       107619      1706.67
    5607.423     0.999512       107632      2048.00
    5611.519     0.999561       107636      2275.56
    5619.711     0.999609       107641      2560.00
    5636.095     0.999658       107646      2925.71
    5652.479     0.999707       107651      3413.33
    5677.055     0.999756       107657      4096.00
    5681.151     0.999780       107661      4551.11
    5681.151     0.999805       107661      5120.00
    5693.439     0.999829       107664      5851.43
    5771.263     0.999854       107667      6826.67
    5779.455     0.999878       107671      8192.00
    5779.455     0.999890       107671      9102.22
    5783.551     0.999902       107674     10240.00
    5783.551     0.999915       107674     11702.86
    5787.647     0.999927       107678     13653.33
    5787.647     0.999939       107678     16384.00
    5787.647     0.999945       107678     18204.44
    5787.647     0.999951       107678     20480.00
    5787.647     0.999957       107678     23405.71
    5791.743     0.999963       107682     27306.67
    5791.743     1.000000       107682          inf
#[Mean    =     1279.290, StdDeviation   =      936.554]
#[Max     =     5787.648, Total count    =       107682]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  117603 requests in 2.00m, 20.86MB read
Requests/sec:    980.02
Transfer/sec:    178.01KB